Tekla Open API Reference for Tekla Structures 2025
Reinforcement.RadiusValues Property
 Gets or sets the radius value(s) of the bends in the bar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList RadiusValues { get; set; }
Public Property RadiusValues As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace